In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../data/API_MS.MIL.XPRT.KD_DS2_en_csv_v2_5455003/API_MS.MIL.XPRT.KD_DS2_en_csv_v2_5455003.csv')

In [3]:
df.head(2)

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2014,2015,2016,2017,2018,2019,2020,2021,2022,Unnamed: 67
0,Aruba,ABW,Arms exports (SIPRI trend indicator values),MS.MIL.XPRT.KD,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Africa Eastern and Southern,AFE,Arms exports (SIPRI trend indicator values),MS.MIL.XPRT.KD,27000000.0,33000000.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
df.columns

Index(['Country Name', 'Country Code', 'Indicator Name', 'Indicator Code',
       '1960', '1961', '1962', '1963', '1964', '1965', '1966', '1967', '1968',
       '1969', '1970', '1971', '1972', '1973', '1974', '1975', '1976', '1977',
       '1978', '1979', '1980', '1981', '1982', '1983', '1984', '1985', '1986',
       '1987', '1988', '1989', '1990', '1991', '1992', '1993', '1994', '1995',
       '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004',
       '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013',
       '2014', '2015', '2016', '2017', '2018', '2019', '2020', '2021', '2022',
       'Unnamed: 67'],
      dtype='object')

In [5]:
df.drop(columns=['Country Name', 'Unnamed: 67', 'Indicator Code', 'Indicator Name'], inplace=True)

In [6]:
df = pd.DataFrame(df.set_index('Country Code').stack()).reset_index()

In [7]:
df.rename(columns={'level_1': 'Year', 0: 'Value'}, inplace=True)

In [8]:
df

     Country Code  Year        Value
0             ABW  1996   18000000.0
1             AFE  1960   27000000.0
2             AFE  1961   33000000.0
3             AFE  1967    5000000.0
4             AFE  1969   14000000.0
...           ...   ...          ...
3135          ZAF  2019  142000000.0
3136          ZAF  2020   37000000.0
3137          ZMB  1990    2000000.0
3138          ZWE  1964    3000000.0
3139          ZWE  2001    4000000.0

[3140 rows x 3 columns]

In [9]:
mapper = pd.read_csv('../data/countries_info.csv').loc[:, ['Alpha-2 code', 'Alpha-3 code']]

In [10]:
df = df.merge(right= mapper, left_on='Country Code', right_on='Alpha-3 code').drop(columns=['Country Code', 'Alpha-3 code']).rename(columns={'Alpha-2 code': 'Destination country'})

In [11]:
df.loc[:, 'Source country'] = 'DE'

In [12]:
df.loc[:, 'source_hash'] = 'cca72340c070e47d08c908db832e7119977e0dce2e287abdce5349a956c61d24'

In [13]:
df

,Year,Value,Destination country,Source country,source_hash
0,1996,18000000.0,AW,DE,cca72340c070e47d08c908db832e7119977e0dce2e287a...
1,1992,1000000.0,AF,DE,cca72340c070e47d08c908db832e7119977e0dce2e287a...
2,1979,3000000.0,AO,DE,cca72340c070e47d08c908db832e7119977e0dce2e287a...
3,1980,0.0,AO,DE,cca72340c070e47d08c908db832e7119977e0dce2e287a...
4,1992,8000000.0,AO,DE,cca72340c070e47d08c908db832e7119977e0dce2e287a...
...,...,...,...,...,...
2180,2019,142000000.0,ZA,DE,cca72340c070e47d08c908db832e7119977e0dce2e287a...
2181,2020,37000000.0,ZA,DE,cca72340c070e47d08c908db832e7119977e0dce2e287a...
2182,1990,2000000.0,ZM,DE,cca72340c070e47d08c908db832e7119977e0dce2e287a...
2183,1964,3000000.0,ZW,DE,cca72340c070e47d08c908db832e7119977e0dce2e287a...
2184,2001,4000000.0,ZW,DE,cca72340c070e47d08c908db832e7119977e0dce2e287a...

In [14]:
#df_source = pd.DataFrame({'source_url': 'https://data.worldbank.org/indicator/MS.MIL.XPRT.KD?locations=DE-PF', 'source_hash': 'cca72340c070e47d08c908db832e7119977e0dce2e287abdce5349a956c61d24', 'source_name': 'The World Bank', 'source_retrieved_timestamp': })

SyntaxError: invalid syntax (1089108509.py, line 1)

In [16]:
from datetime import datetime

timestamp = datetime.now()

In [17]:
timestamp

datetime.datetime(2023, 6, 22, 13, 33, 26, 175440)

In [20]:
df_source = pd.DataFrame({'source_url': ['https://data.worldbank.org/indicator/MS.MIL.XPRT.KD?'], 'source_hash': ['cca72340c070e47d08c908db832e7119977e0dce2e287abdce5349a956c61d24'], 'source_name': ['The World Bank'], 'source_retrieved_timestamp': [timestamp]})

In [22]:
df_source.to_csv('../data/sources.csv')